---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.SizingCalculationFlowOnlyWarn
source: html/c2a6b472-1de4-3c91-1797-85ab78387cfc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.SizingCalculationFlowOnlyWarn Property

Some elements are not sized because the system calculation is flow only. You may change the system calculation level to size them again.

## Syntax (C#)
```csharp
public static FailureDefinitionId SizingCalculationFlowOnlyWarn { get; }
```